Sinsjr2/Arcavirt/doc/spec/RegisterSvdReference/rx64m-crc-pilot.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.3">
  <name>RX64M_CRC_Pilot</name>
  <version>1.0</version>
  <description>RX64M_CRC_Pilot peripheral registers generated from iodefine.h (pilot).</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>CRC</name>
      <baseAddress>0x88280</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CRCCR</name>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>GPS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LMS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DORCLR</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CRCDIR</name>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CRCDOR</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>